In [1]:
# 결측 데이터
# 데이터가 기존 소스에서 누락되었지만, 수학적으로 많은 예측 메소드는 결측 데이터 포인트와 함께 작동하지 않음

# 결측 데이터와 데이터 소스를 확인할 때 기본적으로 세가지 선택사항이 주어짐


# NaN - NaN으로 결측 데이터 보유
# 1. 결측데이터를 제거하는 것 - 기본적으로 행 전체를 삭제
# 2. 결측데이터를 특정 값으로 채우는 것


# 시계열 데이터는 기본적으로 결측이 없음
# 타임 스탬프 데이터를 다루는 경우 어떤 이벤트를 타임스탬프 할 정도로 충분히 정교한 시스템을
# 다루고 있음

# 그런 시스템 설정하면  아무런 누락도 없을거임
# 주가데이터가 그 예시

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.fillna(value='FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [9]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [10]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [11]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64